In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.4.0-cp311-cp311-win_amd64.whl.metadata (2.0 kB)
Downloading mysql_connector_python-8.4.0-cp311-cp311-win_amd64.whl (14.5 MB)
   ---------------------------------------- 0.0/14.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/14.5 MB 1.3 MB/s eta 0:00:12
    --------------------------------------- 0.3/14.5 MB 4.4 MB/s eta 0:00:04
   -- ------------------------------------- 0.8/14.5 MB 6.8 MB/s eta 0:00:03
   --- ------------------------------------ 1.2/14.5 MB 7.9 MB/s eta 0:00:02
   ----- ---------------------------------- 1.9/14.5 MB 9.5 MB/s eta 0:00:02
   ------- -------------------------------- 2.6/14.5 MB 10.2 MB/s eta 0:00:02
   --------- ------------------------------ 3.3/14.5 MB 11.1 MB/s eta 0:00:02
   ---------- ----------------------------- 3.9/14.5 MB 11.2 MB/s eta 0:00:01
   ------------ --------------------------- 4.5/14.5 MB 11.5 MB/s eta 0:00:01
   -------------- ------------------------- 5.1/14.5 MB 11.6 MB/s eta 0:00:01
   --------------- ------------------------ 5.8/14.5 MB 11.9 MB/s eta 0:00:01
   ----------------- ---------------------- 6.5/14.5 MB 12.1 MB/s eta 0:00:01
   ------------------- -------------------- 7.0/14.5 MB 12.1 MB/s eta 0:00:01
   --------------------- ------------------ 7.8/14.5 MB 12.4 MB/s eta 0:00:01
   ----------------------- ---------------- 8.4/14.5 MB 12.6 MB/s eta 0:00:01
   ------------------------ --------------- 9.0/14.5 MB 12.5 MB/s eta 0:00:01
   -------------------------- ------------- 9.7/14.5 MB 12.6 MB/s eta 0:00:01
   ---------------------------- ----------- 10.4/14.5 MB 13.6 MB/s eta 0:00:01
   ------------------------------ --------- 11.0/14.5 MB 13.9 MB/s eta 0:00:01
   -------------------------------- ------- 11.6/14.5 MB 13.9 MB/s eta 0:00:01
   --------------------------------- ------ 12.2/14.5 MB 13.9 MB/s eta 0:00:01
   ----------------------------------- ---- 12.7/14.5 MB 13.6 MB/s eta 0:00:01
   ------------------------------------- -- 13.4/14.5 MB 13.6 MB/s eta 0:00:01
   -------------------------------------- - 14.0/14.5 MB 13.6 MB/s eta 0:00:01
   ---------------------------------------  14.4/14.5 MB 13.4 MB/s eta 0:00:01
   ---------------------------------------- 14.5/14.5 MB 13.1 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.4.0

In [2]:
import mysql.connector # !pip install mysql-connector-python 
from mysql.connector import Error

try: 
    connection = mysql.connector.connect(host=' ', 
                                         database='  ',
                                         user='   ',
                                         password='    ', connection_timeout=180)

    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL database... MySQL Server version on ", db_Info)

        cursor = connection.cursor()
        connection.commit()

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    # closing database connection.
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL database... MySQL Server version on  8.0.34-26
MySQL connection is closed

In [4]:
import pandas as pd

In [42]:
'''Codigo para alinear a la izquierda el df'''

from pandas import DataFrame

def left_align(df: DataFrame):
    left_aligned_df = df.style.set_properties(**{'text-align': 'left'})
    left_aligned_df = left_aligned_df.set_table_styles(        [dict(selector='th', props=[('text-align', 'left')])]
    )
    return left_aligned_df
left_align(df)

In [ ]:
pd.set_option('display.max_columns', None, 'display.max_rows', None)

### 1. Listar todos los productos.

In [43]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor=connection.cursor()
query1 = """ SELECT * FROM PRODUCTO; """
cursor.execute(query1)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [44]:
df1 = pd.read_sql(query1, connection)
left_align(df1)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2402196598.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql(query1, connection)

In [45]:
df1.to_csv('csvs\consulta1.csv', index=False)

### 2. Obtener los nombres de todos los empleados.

In [46]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor=connection.cursor()
query2 = """ SELECT Nombre From EMPLEADO; """
cursor.execute(query2)
cursor.fetchall()

[('María Luisa Galdón Ter',),
 ('Úrsula Delta Camacho',),
 ('Luis Ramírez Pardo',),
 ('Sergio Lérida Campos',),
 ('Piedad Colmenero Zapillo',),
 ('María Sánchez Cid',),
 ('Martín Guerrero López',),
 ('Carmen Hernández Pío',),
 ('Pedro Jiménez Ruiz',),
 ('Soledad Campillo Molina',),
 ('Raúl Rodrigo Roca',)]

In [47]:
df2 = pd.read_sql(query2, connection)
left_align(df2)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2529798854.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, connection)

In [48]:
df2.to_csv('csvs\consulta2.csv', index=False)

### 3. Contar el número de pedidos realizados.

In [49]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor=connection.cursor()
query3 = ''' SELECT COUNT(numero)  FROM PEDIDO; '''
cursor.execute(query3)
cursor.fetchall()

[(11,)]

In [50]:
df3 = pd.read_sql(query3, connection)
left_align(df3)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\167099386.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df3 = pd.read_sql(query3, connection)

In [51]:
df3.to_csv('csvs\consulta3.csv', index=False)

### 4. Listar los repartidores que trabajan en el turno de tarde.

In [52]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor=connection.cursor()
query4=''' SELECT Nombre FROM REPARTIDOR WHERE Turno = 'Tarde'; '''
cursor.execute(query4)
cursor.fetchall()

[('Carlos Sánchez Ruíz',), ('Carmen Capel Pío',)]

In [53]:
df4 = pd.read_sql(query4, connection)
left_align(df4)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3948834534.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4 = pd.read_sql(query4, connection)

In [54]:
df4.to_csv('csvs\consulta4.csv', index=False)

### 5. Encontrar el precio más alto de los productos.

In [55]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query5 = ''' SELECT MAX(precio) FROM PRODUCTO; '''
cursor.execute(query5)
cursor.fetchall()

[(6.0,)]

In [56]:
df5 = pd.read_sql(query5, connection)
left_align(df5)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3942403686.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df5 = pd.read_sql(query5, connection)

In [57]:
df5.to_csv('csvs\consulta5.csv', index=False)

### 6.Mostrar todos los pedidos con un importe mayor a 100.

In [68]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query6 = ''' SELECT * FROM PEDIDO WHERE importe > 100; '''
cursor.execute(query6)
cursor.fetchall()

[]

In [69]:
df6 = pd.read_sql(query6, connection)
left_align(df6)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\1454201456.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df6 = pd.read_sql(query6, connection)

In [70]:
df6.to_csv('csvs\consulta6.csv', index=False)

### 7. Obtener el salario promedio de los empleados.

In [71]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor =connection.cursor()
query7 = '''SELECT AVG(salario) FROM EMPLEADO;'''
cursor.execute(query7)
cursor.fetchall()

[(1027.272727,)]

In [72]:
df7 = pd.read_sql(query7, connection)
left_align(df7)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3682258350.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df7 = pd.read_sql(query7, connection)

In [73]:
df7.to_csv('csvs\consulta7.csv', index=False)

### 8. Listar los productos que tienen un nombre único (sin duplicados).

In [74]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query8 = '''SELECT DISTINCT* FROM PRODUCTO;'''
cursor.execute(query8)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [75]:
df8 = pd.read_sql(query8, connection)
left_align(df8)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3251185271.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df8 = pd.read_sql(query8, connection)

In [76]:
df8.to_csv('csvs\consulta8.csv', index=False)

### 9. Mostrar el número y la fecha de todos los pedidos realizados en el último mes.

In [77]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query9 = '''SELECT numero, fecha FROM PEDIDO WHERE fecha LIKE '%2020-11%';'''
cursor.execute(query9)
cursor.fetchall()

[('0002', datetime.date(2020, 11, 11)),
 ('0004', datetime.date(2020, 11, 10)),
 ('0006', datetime.date(2020, 11, 15)),
 ('0009', datetime.date(2020, 11, 23)),
 ('0010', datetime.date(2020, 11, 5)),
 ('0011', datetime.date(2020, 11, 5))]

In [78]:
df9 = pd.read_sql(query9, connection)
left_align(df9)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2293376910.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df9 = pd.read_sql(query9, connection)

In [79]:
df9.to_csv('csvs\consulta9.csv', index=False)

### 10. Encontrar el empleado con el salario más bajo.

In [81]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query10 = '''SELECT nombre
	FROM EMPLEADO
    WHERE salario = (SELECT MIN(salario) FROM EMPLEADO);'''
cursor.execute(query10)
cursor.fetchall()

[('Úrsula Delta Camacho',), ('Luis Ramírez Pardo',), ('Carmen Hernández Pío',)]

In [82]:
df10 = pd.read_sql(query10, connection)
left_align(df10)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\485508511.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df10 = pd.read_sql(query10, connection)

In [83]:
df10.to_csv('csvs\consulta10.csv', index=False)

### 11. Listar los productos y sus componentes.

In [110]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query11 = '''SELECT 
    p.Codigo AS Producto_Codigo,
    p.Nombre AS Producto_Nombre,
    p.Precio AS Producto_Precio,
    c.Codigo_P_compuesto AS Componente_Codigo,
    pc.Nombre AS Componente_Nombre,
    pc.Precio AS Componente_Precio
FROM 
    PRODUCTO p
LEFT JOIN 
    esta_compuesto c ON p.Codigo = c.Codigo_P
LEFT JOIN 
    PRODUCTO pc ON c.Codigo_P_compuesto = pc.Codigo
ORDER BY 
    p.Codigo, c.Codigo_P_compuesto;'''
cursor.execute(query11)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6, None, None, None),
 ('02', 'Patatas', 2.0, None, None, None),
 ('03', 'tomate', 0.5, None, None, None),
 ('04', 'Queso', 1.0, None, None, None),
 ('05', 'Lechuga', 0.5, None, None, None),
 ('06', 'Pollo', 3.6, None, None, None),
 ('08', 'Bacon', 1.5, None, None, None),
 ('09', 'Coca cola', 3.0, None, None, None),
 ('10', 'Nestea', 3.0, None, None, None),
 ('11', 'Menú de Pollo', 5.0, '02', 'Patatas', 2.0),
 ('11', 'Menú de Pollo', 5.0, '03', 'tomate', 0.5),
 ('11', 'Menú de Pollo', 5.0, '06', 'Pollo', 3.6),
 ('11', 'Menú de Pollo', 5.0, '17', 'Fruta', 1.0),
 ('11', 'Menú de Pollo', 5.0, '18', 'Agua', 2.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '01', 'Hamburguesa', 2.6),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '02', 'Patatas', 2.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '04', 'Queso', 1.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '10', 'Nestea', 3.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '16', 'Tarta', 2.0),
 ('13', 'Menú de Pollo con queso', 6.0, '02', 'Patatas', 2.0),
 ('13', 'Menú de Pollo con queso', 6.0, '04', 'Queso', 1.0),
 ('13', 'Menú de Pollo con queso', 6.0, '06', 'Pollo', 3.6),
 ('13', 'Menú de Pollo con queso', 6.0, '08', 'Bacon', 1.5),
 ('13', 'Menú de Pollo con queso', 6.0, '09', 'Coca cola', 3.0),
 ('13', 'Menú de Pollo con queso', 6.0, '15', 'Helado', 1.0),
 ('14', 'Menú de Hamburguesa', 6.0, '01', 'Hamburguesa', 2.6),
 ('14', 'Menú de Hamburguesa', 6.0, '02', 'Patatas', 2.0),
 ('14', 'Menú de Hamburguesa', 6.0, '03', 'tomate', 0.5),
 ('14', 'Menú de Hamburguesa', 6.0, '05', 'Lechuga', 0.5),
 ('14', 'Menú de Hamburguesa', 6.0, '08', 'Bacon', 1.5),
 ('14', 'Menú de Hamburguesa', 6.0, '09', 'Coca cola', 3.0),
 ('14', 'Menú de Hamburguesa', 6.0, '15', 'Helado', 1.0),
 ('15', 'Helado', 1.0, None, None, None),
 ('16', 'Tarta', 2.0, None, None, None),
 ('17', 'Fruta', 1.0, None, None, None),
 ('18', 'Agua', 2.0, None, None, None),
 ('19', 'Fanta', 3.0, None, None, None)]

In [111]:
df11 = pd.read_sql(query11, connection)
left_align(df11)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\1624814681.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df11 = pd.read_sql(query11, connection)

In [112]:
df11.to_csv('csvs\consulta11.csv', index=False)

### 12. Obtener el importe total de todos los pedidos.

In [90]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query12 = '''SELECT SUM(importe) FROM PEDIDO;'''
cursor.execute(query12)
cursor.fetchall()

[(234.0,)]

In [91]:
df12 = pd.read_sql(query12, connection)
left_align(df12)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\658907531.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df12 = pd.read_sql(query12, connection)

In [92]:
df12.to_csv('csvs\consulta12.csv', index=False)

### 13. Mostrar los empleados que no son repartidores.

In [93]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query13 = '''SELECT nombre FROM EMPLEADO;'''
cursor.execute(query13)
cursor.fetchall()

[('María Luisa Galdón Ter',),
 ('Úrsula Delta Camacho',),
 ('Luis Ramírez Pardo',),
 ('Sergio Lérida Campos',),
 ('Piedad Colmenero Zapillo',),
 ('María Sánchez Cid',),
 ('Martín Guerrero López',),
 ('Carmen Hernández Pío',),
 ('Pedro Jiménez Ruiz',),
 ('Soledad Campillo Molina',),
 ('Raúl Rodrigo Roca',)]

In [94]:
df13 = pd.read_sql(query13, connection)
left_align(df13)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3883311498.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df13 = pd.read_sql(query13, connection)

In [95]:
df13.to_csv('csvs\consulta13.csv', index=False)

### 14. Listar los pedidos junto con el nombre del empleado que tomó el pedido.

In [96]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query14 = '''SELECT p.numero, e.nombre
FROM PEDIDO AS p
INNER JOIN EMPLEADO AS e ON p.DNI_EP = e.DNI;'''
cursor.execute(query14)
cursor.fetchall()

[('0005', 'María Luisa Galdón Ter'),
 ('0001', 'Úrsula Delta Camacho'),
 ('0010', 'Piedad Colmenero Zapillo'),
 ('0011', 'Piedad Colmenero Zapillo'),
 ('0003', 'María Sánchez Cid'),
 ('0008', 'Martín Guerrero López'),
 ('0009', 'Carmen Hernández Pío'),
 ('0002', 'Pedro Jiménez Ruiz'),
 ('0004', 'Pedro Jiménez Ruiz'),
 ('0006', 'Soledad Campillo Molina'),
 ('0007', 'Soledad Campillo Molina')]

In [97]:
df14 = pd.read_sql(query14, connection)
left_align(df14)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2416693713.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df14 = pd.read_sql(query14, connection)

In [98]:
df14.to_csv('csvs\consulta14.csv', index=False)

### 15. Encontrar la cantidad total de productos en cada pedido.

In [100]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query15 = '''SELECT numero_p, cantidad FROM consta;'''
cursor.execute(query15)
cursor.fetchall()

[('0005', 1),
 ('0007', 1),
 ('0004', 1),
 ('0010', 3),
 ('0011', 2),
 ('0007', 1),
 ('0001', 2),
 ('0002', 1),
 ('0008', 1),
 ('0001', 1),
 ('0002', 2),
 ('0005', 1),
 ('0006', 2),
 ('0007', 2),
 ('0010', 3),
 ('0004', 3),
 ('0005', 2),
 ('0006', 1),
 ('0008', 2),
 ('0009', 4),
 ('0010', 3),
 ('0003', 2),
 ('0002', 2),
 ('0009', 1),
 ('0010', 3),
 ('0003', 1),
 ('0006', 1),
 ('0006', 1)]

In [101]:
df15 = pd.read_sql(query15, connection)
left_align(df15)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\84671114.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df15 = pd.read_sql(query15, connection)

In [102]:
df15.to_csv('csvs\consulta15.csv', index=False)

### 16. Obtener el nombre del repartidor y el importe de los pedidos que ha entregado.

In [107]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query16 = '''SELECT r.nombre, p.importe
FROM PEDIDO AS p
INNER JOIN REPARTIDOR AS r ON p.DNI_R = r.DNI;'''
cursor.execute(query16)
cursor.fetchall()

[('Laura Jiménez Jiménez', 13.0),
 ('Laura Jiménez Jiménez', 23.0),
 ('Juan Pardo Rubio', 14.0),
 ('Carlos Sánchez Ruíz', 14.0),
 ('Carlos Sánchez Ruíz', 17.0),
 ('Juan Sánchez López', 10.0),
 ('Alejandro Pardo López', 15.0),
 ('Alejandro Pardo López', 13.0),
 ('Alejandro Pardo López', 25.0)]

In [108]:
df16 = pd.read_sql(query16, connection)
left_align(df16)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\1869198543.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df16 = pd.read_sql(query16, connection)

In [109]:
df16.to_csv('csvs\consulta16.csv', index=False)

### 17. Listar todos los pedidos junto con la hora en que fueron tomados y preparados

In [114]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query17 = '''SELECT numero, hora_tm, hora_pre
FROM PEDIDO
ORDER BY hora_tm ASC;'''
cursor.execute(query17)
cursor.fetchall()

[('0009',
  datetime.timedelta(seconds=39720),
  datetime.timedelta(seconds=41400)),
 ('0001',
  datetime.timedelta(seconds=43200),
  datetime.timedelta(seconds=44100)),
 ('0002',
  datetime.timedelta(seconds=48600),
  datetime.timedelta(seconds=49500)),
 ('0004',
  datetime.timedelta(seconds=50520),
  datetime.timedelta(seconds=52200)),
 ('0003',
  datetime.timedelta(seconds=54000),
  datetime.timedelta(seconds=54900)),
 ('0008',
  datetime.timedelta(seconds=64920),
  datetime.timedelta(seconds=66600)),
 ('0005',
  datetime.timedelta(seconds=68520),
  datetime.timedelta(seconds=70200)),
 ('0006',
  datetime.timedelta(seconds=75720),
  datetime.timedelta(seconds=77700)),
 ('0010',
  datetime.timedelta(seconds=79500),
  datetime.timedelta(seconds=79920)),
 ('0011', datetime.timedelta(seconds=79500), None),
 ('0007',
  datetime.timedelta(seconds=83100),
  datetime.timedelta(seconds=83520))]

In [115]:
df17 = pd.read_sql(query17, connection)
left_align(df17)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\654980495.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df17 = pd.read_sql(query17, connection)

In [116]:
df17.to_csv('csvs\consulta17.csv', index=False)

### 18. Mostrar el total de incentivos pagados a los repartidores.

In [117]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query18 = '''SELECT SUM(incentivo) FROM REPARTIDOR;'''
cursor.execute(query18)
cursor.fetchall()

[(2000.0,)]

In [118]:
df18 = pd.read_sql(query18, connection)
left_align(df18)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\1871482429.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df18 = pd.read_sql(query18, connection)

In [119]:
df18.to_csv('csvs\consulta18.csv', index=False)

### 19. Encontrar los empleados que han tomado más de 5 pedidos.

In [121]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query19 = '''SELECT e.nombre, COUNT(DISTINCT p.numero) AS numero_pedidos
FROM PEDIDO AS p
INNER JOIN EMPLEADO AS e ON p.DNI_EP = e.DNI
GROUP BY e.nombre
HAVING numero_pedidos > 5;'''
cursor.execute(query19)
cursor.fetchall()

[]

In [122]:
df19 = pd.read_sql(query19, connection)
left_align(df19)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\1725146508.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df19 = pd.read_sql(query19, connection)

In [123]:
df19.to_csv('csvs\consulta19.csv', index=False)

### 20. Listar todos los pedidos junto con el nombre del empleado que los preparó.

In [125]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query20 = '''SELECT p.numero as Numero_pedido, e.nombre as Nombre_empleado, pr.nombre as producto 
FROM PEDIDO as p
INNER JOIN EMPLEADO as e ON p.DNI_EP = e.DNI
INNER JOIN consta as c ON p.numero = c.numero_p
INNER JOIN PRODUCTO as pr ON c.codigo_pr = pr.codigo;'''
cursor.execute(query20)
cursor.fetchall()

[('0005', 'María Luisa Galdón Ter', 'Patatas'),
 ('0005', 'María Luisa Galdón Ter', 'Menú de Hamburguesa con queso'),
 ('0005', 'María Luisa Galdón Ter', 'Menú de Pollo con queso'),
 ('0001', 'Úrsula Delta Camacho', 'Menú de Pollo'),
 ('0001', 'Úrsula Delta Camacho', 'Menú de Hamburguesa con queso'),
 ('0010', 'Piedad Colmenero Zapillo', 'Queso'),
 ('0010', 'Piedad Colmenero Zapillo', 'Menú de Hamburguesa con queso'),
 ('0010', 'Piedad Colmenero Zapillo', 'Menú de Pollo con queso'),
 ('0010', 'Piedad Colmenero Zapillo', 'Tarta'),
 ('0011', 'Piedad Colmenero Zapillo', 'Queso'),
 ('0003', 'María Sánchez Cid', 'Menú de Hamburguesa'),
 ('0003', 'María Sánchez Cid', 'Fruta'),
 ('0008', 'Martín Guerrero López', 'Menú de Pollo'),
 ('0008', 'Martín Guerrero López', 'Menú de Pollo con queso'),
 ('0009', 'Carmen Hernández Pío', 'Menú de Pollo con queso'),
 ('0009', 'Carmen Hernández Pío', 'Helado'),
 ('0002', 'Pedro Jiménez Ruiz', 'Menú de Pollo'),
 ('0002', 'Pedro Jiménez Ruiz', 'Menú de Hamburguesa con queso'),
 ('0002', 'Pedro Jiménez Ruiz', 'Helado'),
 ('0004', 'Pedro Jiménez Ruiz', 'Queso'),
 ('0004', 'Pedro Jiménez Ruiz', 'Menú de Pollo con queso'),
 ('0006', 'Soledad Campillo Molina', 'Menú de Hamburguesa con queso'),
 ('0006', 'Soledad Campillo Molina', 'Menú de Pollo con queso'),
 ('0006', 'Soledad Campillo Molina', 'Agua'),
 ('0006', 'Soledad Campillo Molina', 'Fanta'),
 ('0007', 'Soledad Campillo Molina', 'Patatas'),
 ('0007', 'Soledad Campillo Molina', 'Coca cola'),
 ('0007', 'Soledad Campillo Molina', 'Menú de Hamburguesa con queso')]

In [126]:
df20 = pd.read_sql(query20, connection)
left_align(df20)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2511702440.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df20 = pd.read_sql(query20, connection)

In [127]:
df20.to_csv('csvs\consulta20.csv', index=False)

### 21. Mostrar los productos cuyo precio es mayor que el precio promedio de todos los productos.

In [135]:
connection = mysql.connector.connect(host=' ', database='  ', user='   ', password='    ', connection_timeout= )
cursor = connection.cursor()
query21 = '''SELECT nombre, precio FROM PRODUCTO WHERE precio >(SELECT AVG(precio) FROM PRODUCTO)
ORDER BY precio ASC;'''
cursor.execute(query21)
cursor.fetchall()

[('Coca cola', 3.0),
 ('Nestea', 3.0),
 ('Fanta', 3.0),
 ('Pollo', 3.6),
 ('Menú de Pollo', 5.0),
 ('Menú de Hamburguesa con queso', 6.0),
 ('Menú de Pollo con queso', 6.0),
 ('Menú de Hamburguesa', 6.0)]

In [136]:
df21 = pd.read_sql(query21, connection)
left_align(df21)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2121420067.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df21 = pd.read_sql(query21, connection)

In [137]:
df21.to_csv('csvs\consulta21.csv', index=False)

###  22. Listar los empleados y repartidores con el mismo turno.

In [140]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query22 = '''SELECT * FROM (SELECT nombre, turno FROM EMPLEADO UNION ALL SELECT nombre, turno FROM REPARTIDOR) AS unioned ORDER BY turno, nombre;'''
cursor.execute(query22)
cursor.fetchall()

[('Alejandro Pardo López', 'mañana'),
 ('Carmen Hernández Pío', 'mañana'),
 ('Juan Sánchez López', 'mañana'),
 ('Luis Ramírez Pardo', 'mañana'),
 ('Úrsula Delta Camacho', 'mañana'),
 ('Juan Pardo Rubio', 'noche'),
 ('Laura Jiménez Jiménez', 'noche'),
 ('María Luisa Galdón Ter', 'noche'),
 ('Piedad Colmenero Zapillo', 'noche'),
 ('Soledad Campillo Molina', 'noche'),
 ('Carlos Sánchez Ruíz', 'tarde'),
 ('Carmen Capel Pío', 'tarde'),
 ('María Sánchez Cid', 'tarde'),
 ('Martín Guerrero López', 'tarde'),
 ('Pedro Jiménez Ruiz', 'tarde'),
 ('Raúl Rodrigo Roca', 'tarde'),
 ('Sergio Lérida Campos', 'tarde')]

In [141]:
df22 = pd.read_sql(query22, connection)
left_align(df22)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\283141536.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df22 = pd.read_sql(query22, connection)

In [143]:
df22.to_csv('csvs\consulta22.csv', index=False)

### 23. Obtener los pedidos junto con el nombre del empleado que los tomó y el nombre del repartidor que los entregó.

In [145]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query23 = '''SELECT p.numero, e.nombre AS Empleado, r.nombre AS Repartidor
FROM PEDIDO AS p
JOIN EMPLEADO AS e ON p.DNI_EP = e.DNI
JOIN REPARTIDOR AS r ON p.DNI_R = r.DNI;'''
cursor.execute(query23)
cursor.fetchall()

[('0004', 'Pedro Jiménez Ruiz', 'Laura Jiménez Jiménez'),
 ('0006', 'Soledad Campillo Molina', 'Laura Jiménez Jiménez'),
 ('0008', 'Martín Guerrero López', 'Juan Pardo Rubio'),
 ('0005', 'María Luisa Galdón Ter', 'Carlos Sánchez Ruíz'),
 ('0007', 'Soledad Campillo Molina', 'Carlos Sánchez Ruíz'),
 ('0001', 'Úrsula Delta Camacho', 'Juan Sánchez López'),
 ('0002', 'Pedro Jiménez Ruiz', 'Alejandro Pardo López'),
 ('0003', 'María Sánchez Cid', 'Alejandro Pardo López'),
 ('0009', 'Carmen Hernández Pío', 'Alejandro Pardo López')]

In [146]:
df23 = pd.read_sql(query23, connection)
left_align(df23)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3477407828.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df23 = pd.read_sql(query23, connection)

In [147]:
df23.to_csv('csvs\consulta23.csv', index=False)

### 24. Mostrar los nombres de los productos en mayúsculas.

In [151]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query24 = '''SELECT UPPER(nombre) as PRODUCTOS FROM PRODUCTO;'''
cursor.execute(query24)
cursor.fetchall()

[('AGUA',),
 ('BACON',),
 ('COCA COLA',),
 ('FANTA',),
 ('FRUTA',),
 ('HAMBURGUESA',),
 ('HELADO',),
 ('LECHUGA',),
 ('MENÚ DE HAMBURGUESA',),
 ('MENÚ DE HAMBURGUESA CON QUESO',),
 ('MENÚ DE POLLO',),
 ('MENÚ DE POLLO CON QUESO',),
 ('NESTEA',),
 ('PATATAS',),
 ('POLLO',),
 ('QUESO',),
 ('TARTA',),
 ('TOMATE',)]

In [152]:
df24 = pd.read_sql(query24, connection)
left_align(df24)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\1385786268.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df24 = pd.read_sql(query24, connection)

In [153]:
df24.to_csv('csvs\consulta24.csv', index=False)

### 25. Obtener el número de pedidos y el total del importe para cada repartidor.

In [154]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query25 = '''SELECT r.nombre as Repartidor, COUNT(p.numero) as Numero_Pedidos, SUM(p.importe) as Total_Importe
FROM PEDIDO as p
JOIN REPARTIDOR as r ON p.DNI_r = r.DNI
GROUP BY r.nombre
ORDER BY Numero_pedidos DESC;'''
cursor.execute(query25)
cursor.fetchall()

[('Alejandro Pardo López', 3, 53.0),
 ('Laura Jiménez Jiménez', 2, 36.0),
 ('Carlos Sánchez Ruíz', 2, 31.0),
 ('Juan Pardo Rubio', 1, 14.0),
 ('Juan Sánchez López', 1, 10.0)]

In [155]:
df25 = pd.read_sql(query25, connection)
left_align(df25)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2211371322.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df25 = pd.read_sql(query25, connection)

In [156]:
df25.to_csv('csvs\consulta25.csv', index=False)

### 26. Mostrar los pedidos realizados en el año 2023.

In [157]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query26 = '''SELECT numero as Numero_pedido, fecha
FROM PEDIDO
WHERE fecha BETWEEN '2023-01-01' AND '2023-12-31';'''
cursor.execute(query26)
cursor.fetchall()

[]

In [158]:
df26 = pd.read_sql(query26, connection)
left_align(df26)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\1425475203.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df26 = pd.read_sql(query26, connection)

In [159]:
df26.to_csv('csvs\consulta26.csv', index=False)

### 27. Listar los repartidores que han entregado pedidos en la última semana.

In [166]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query27 = '''SELECT Nombre, DNI FROM REPARTIDOR WHERE DNI IN (SELECT DNI_R FROM PEDIDO Where Fecha >= (DATE_SUB(CURDATE(), INTERVAL 1 WEEK)));'''
cursor.execute(query27)
cursor.fetchall()

[]

In [167]:
df27 = pd.read_sql(query27, connection)
left_align(df27)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3532403309.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df27 = pd.read_sql(query27, connection)

In [168]:
df27.to_csv('csvs\consulta27.csv', index=False)

### 28. Obtener la diferencia en días entre la fecha del pedido y la fecha actual para todos los pedidos.

In [169]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query28 = '''SELECT fecha as fecha_pedido, CURDATE() as fecha_Actual, DATEDIFF(CURDATE(), fecha) as Dias_diferencia
FROM PEDIDO;'''
cursor.execute(query28)
cursor.fetchall()

[(datetime.date(2020, 10, 15), datetime.date(2024, 5, 30), 1323),
 (datetime.date(2020, 11, 11), datetime.date(2024, 5, 30), 1296),
 (datetime.date(2020, 10, 15), datetime.date(2024, 5, 30), 1323),
 (datetime.date(2020, 11, 10), datetime.date(2024, 5, 30), 1297),
 (datetime.date(2020, 9, 5), datetime.date(2024, 5, 30), 1363),
 (datetime.date(2020, 11, 15), datetime.date(2024, 5, 30), 1292),
 (datetime.date(2020, 9, 25), datetime.date(2024, 5, 30), 1343),
 (datetime.date(2020, 9, 15), datetime.date(2024, 5, 30), 1353),
 (datetime.date(2020, 11, 23), datetime.date(2024, 5, 30), 1284),
 (datetime.date(2020, 11, 5), datetime.date(2024, 5, 30), 1302),
 (datetime.date(2020, 11, 5), datetime.date(2024, 5, 30), 1302)]

In [170]:
df28 = pd.read_sql(query28, connection)
left_align(df28)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\4041525905.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df28 = pd.read_sql(query28, connection)

In [171]:
df28.to_csv('csvs\consulta28.csv', index=False)

### 29. Listar los empleados que trabajan en el turno de mañana y tienen un salario mayor a 2000.

In [172]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query29 = '''SELECT nombre, salario
FROM EMPLEADO
WHERE salario > 2000;'''
cursor.execute(query29)
cursor.fetchall()

[]

In [173]:
df29 = pd.read_sql(query29, connection)
left_align(df29)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2770664110.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df29 = pd.read_sql(query29, connection)

In [174]:
df29.to_csv('csvs\consulta29.csv', index=False)

### 30. Mostrar los productos y su precio con un incremento del 10%

In [192]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query30 = '''SELECT nombre, salario
FROM EMPLEADO
WHERE salario > 2000;'''
cursor.execute(query30)
cursor.fetchall()

[]

In [193]:
df30 = pd.read_sql(query30, connection)
left_align(df30)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\1632913577.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df30 = pd.read_sql(query30, connection)

In [194]:
df30.to_csv('csvs\consulta30.csv', index=False)

### 31. Obtener los pedidos cuyo importe es el mayor entre todos los pedidos.

In [183]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query31 = '''SELECT numero, importe AS importe_max FROM PEDIDO WHERE Importe = (SELECT Max(Importe) FROM PEDIDO);'''
cursor.execute(query31)
cursor.fetchall()

[('0010', 45.0), ('0011', 45.0)]

In [184]:
df31 = pd.read_sql(query31, connection)
left_align(df31)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3638300578.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df31 = pd.read_sql(query31, connection)

In [185]:
df31.to_csv('csvs\consulta31.csv', index=False)

### 32. Listar los empleados que no han tomado ningún pedido.

In [186]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query32 = '''SELECT e.nombre as empleado_sin_pedidos
FROM EMPLEADO as e
LEFT JOIN PEDIDO as p ON e.DNI = p.DNI_EP
WHERE p.DNI_EP IS NULL;'''
cursor.execute(query32)
cursor.fetchall()

[('Luis Ramírez Pardo',), ('Sergio Lérida Campos',), ('Raúl Rodrigo Roca',)]

In [187]:
df32 = pd.read_sql(query32, connection)
left_align(df32)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\3448740340.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df32 = pd.read_sql(query32, connection)

In [188]:
df32.to_csv('csvs\consulta32.csv', index=False)

### 33. Mostrar el nombre del repartidor y la fecha del pedido para los pedidos entregados en el turno de noche.

In [189]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query33 = '''SELECT r.nombre as nombre_repartidor, p.fecha as fecha_pedido, r.turno as turno
FROM PEDIDO as p
JOIN REPARTIDOR as r ON p.DNI_R = r.DNI
HAVING turno = 'noche';'''
cursor.execute(query33)
cursor.fetchall()

[('Laura Jiménez Jiménez', datetime.date(2020, 11, 10), 'noche'),
 ('Laura Jiménez Jiménez', datetime.date(2020, 11, 15), 'noche'),
 ('Juan Pardo Rubio', datetime.date(2020, 9, 15), 'noche')]

In [190]:
df33 = pd.read_sql(query33, connection)
left_align(df33)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\2955445043.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df33 = pd.read_sql(query33, connection)

In [191]:
df33.to_csv('csvs\consulta33.csv', index=False)

### 34. Obtener el nombre del producto más caro y su precio.

In [195]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query34 = '''SELECT nombre as producto_mas_caro, precio
FROM PRODUCTO
WHERE PRECIO = (SELECT MAX(precio) FROM PRODUCTO);'''
cursor.execute(query34)
cursor.fetchall()

[('Menú de Hamburguesa con queso', 6.0),
 ('Menú de Pollo con queso', 6.0),
 ('Menú de Hamburguesa', 6.0)]

In [196]:
df34 = pd.read_sql(query34, connection)
left_align(df34)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\884454965.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df34 = pd.read_sql(query34, connection)

In [197]:
df34.to_csv('csvs\consulta34.csv', index=False)

### 35. Mostrar el nombre del empleado y el importe total de los pedidos que ha tomado.

In [200]:
connection = mysql.connector.connect(host=' ', database=' ', user=' ', password=' ', connection_timeout= )
cursor = connection.cursor()
query35 = '''SELECT e.nombre as nombre_empleado, SUM(importe) as importe_total_pedidos_tomados
FROM PEDIDO p
JOIN EMPLEADO as e ON p.DNI_EP = e.DNI
GROUP BY nombre_empleado
ORDER BY importe_total_pedidos_tomados DESC;'''
cursor.execute(query35)
cursor.fetchall()

[('Piedad Colmenero Zapillo', 90.0),
 ('Soledad Campillo Molina', 40.0),
 ('Pedro Jiménez Ruiz', 28.0),
 ('Carmen Hernández Pío', 25.0),
 ('María Luisa Galdón Ter', 14.0),
 ('Martín Guerrero López', 14.0),
 ('María Sánchez Cid', 13.0),
 ('Úrsula Delta Camacho', 10.0)]

In [201]:
df35 = pd.read_sql(query35, connection)
left_align(df35)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_111492\979640521.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df35 = pd.read_sql(query35, connection)

In [202]:
df35.to_csv('csvs\consulta35.csv', index=False)